una1veritas/Workspace/STM32_Sample-Project/gpio_4led_roll/main.c
/**
  ******************************************************************************
  * @file    gpio_4led_roll/main.c
  * @author  Yasuo Kawachi
  * @version V1.0.0
  * @date    04/15/2009
  * @brief   Main program body
  ******************************************************************************
  * @copy
  *
  * Copyright 2008-2009 Yasuo Kawachi All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted provided that the following conditions are met:
  *  1. Redistributions of source code must retain the above copyright notice,
  *  this list of conditions and the following disclaimer.
  *  2. Redistributions in binary form must reproduce the above copyright notice,
  *  this list of conditions and the following disclaimer in the documentation
  *  and/or other materials provided with the distribution.
  *
  * THIS SOFTWARE IS PROVIDED BY YASUO KAWACHI "AS IS" AND ANY EXPRESS OR IMPLIE  D
  * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
  * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
  * EVENT SHALL YASUO KAWACHI OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
  * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  * This software way contain the part of STMicroelectronics firmware.
  * Below notice is applied to the part, but the above BSD license is not.
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * COPYRIGHT 2009 STMicroelectronics
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "platform_config.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void GPIO_Configuration(void);
void Delay(__IO uint32_t nCount);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program.
  * @param  None
  * @retval : None
  */
int main(void)
{

  // Configure board specific setting
  BoardInit();
  /* GPIO Configuration*/
  GPIO_Configuration();

  __IO uint32_t i;
  const uint32_t t = 100000;

  while (1)
  {
    for (i= 0; i<37; i=i+4)
      {
        /* Turn off GPIOX_0-3 */
        GPIO_ResetBits(GPIOX_PORT, GPIOX_0_PIN | GPIOX_1_PIN | GPIOX_2_PIN | GPIOX_3_PIN);
        /* Turn on GPIOX_0 */
        GPIO_SetBits(GPIOX_PORT, GPIOX_0_PIN);
        /* Insert delay */
        Delay((i+0)*t);

        /* Turn off GPIOX_0-3 */
        GPIO_ResetBits(GPIOX_PORT, GPIOX_0_PIN | GPIOX_1_PIN | GPIOX_2_PIN | GPIOX_3_PIN);
        /* Turn on GPIOX_1 */
        GPIO_SetBits(GPIOX_PORT, GPIOX_1_PIN);
        /* Insert delay */
        Delay((i+1)*t);

        /* Turn off GPIOX_0-3 */
        GPIO_ResetBits(GPIOX_PORT, GPIOX_0_PIN | GPIOX_1_PIN | GPIOX_2_PIN | GPIOX_3_PIN);
        /* Turn on GPIOX_2 */
        GPIO_SetBits(GPIOX_PORT, GPIOX_2_PIN);
        /* Insert delay */
        Delay((i+2)*t);

        /* Turn off GPIOX_0-3 */
        GPIO_ResetBits(GPIOX_PORT, GPIOX_0_PIN | GPIOX_1_PIN | GPIOX_2_PIN | GPIOX_3_PIN);
        /* Turn on GPIOX_3 */
        GPIO_SetBits(GPIOX_PORT, GPIOX_3_PIN);
        /* Insert delay */
        Delay((i+3)*t);
      }
  }
}

/**
  * @brief  Configure the GPIO Pins.
  * @param  None
  * @retval : None
  */
void GPIO_Configuration(void)
{
  //Supply APB2 Clock
  RCC_APB2PeriphClockCmd(GPIOX_RCC, ENABLE);

  GPIO_InitTypeDef GPIO_InitStructure;

  /* GPIO Configuration: output push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIOX_0_PIN | GPIOX_1_PIN | GPIOX_2_PIN | GPIOX_3_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOX_PORT, &GPIO_InitStructure);
}

/**
  * @brief  Inserts a delay time.
  * @param nCount: specifies the delay time length.
  * @retval : None
  */
void Delay(__IO uint32_t nCount)
{
  for(; nCount != 0; nCount--);
}

